alpha_0.5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/




FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hill
    {
        type            wall;
        inGroups        1(wall);
        nFaces          524;
        startFace       21084;
    }
    top-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       21608;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10597;
        startFace       21698;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10597;
        startFace       32295;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          45;
        startFace       42892;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  cyclicAMI_inlet;
        separationVector ( -4.5 0 0 );
        lowWeightCorrection 0.01;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          45;
        startFace       42937;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  cyclicAMI_outlet;
        separationVector ( 4.5 0 0 );
        lowWeightCorrection 0.01;
    }
)

// ************************************************************************* //
