alpha_0.5/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
10597
(
( 1.793250522e-05 6.086924259e-06 -2.340611331e-07 2.19909798e-05 -4.318500668e-09 9.152872371e-05 )
( 1.73141616e-05 6.926291007e-06 -2.269403865e-07 2.203607255e-05 -3.335242305e-09 9.0628404e-05 )
( 1.984773735e-05 4.094536507e-06 -3.022915962e-07 2.184843106e-05 3.604793619e-08 8.921579865e-05 )
( 1.913320921e-05 4.870929843e-06 -2.746464247e-07 2.174787005e-05 3.045692054e-08 8.879341476e-05 )
( 1.491747753e-05 9.930075976e-06 -1.763580713e-07 2.266494266e-05 2.294660817e-08 8.914864156e-05 )
( 1.491894545e-05 9.928292457e-06 -1.763507242e-07 2.266324736e-05 2.306108371e-08 8.913838246e-05 )
( 2.264755312e-05 1.484683821e-06 -3.616952995e-07 2.179786679e-05 5.91899223e-08 8.588687342e-05 )
( 1.697337939e-05 7.494124475e-06 -1.864155195e-07 2.198345101e-05 6.745156611e-08 8.818725473e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
