alpha_0.5/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/





FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1.5e-08;

boundaryField
{
    hill
    {
        type            kqRWallFunction;
        value           uniform 1.5e-08;
    }
    top-wall
    {
        type            kqRWallFunction;
        value           uniform 1.5e-08;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform 1.5e-08;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform 1.5e-08;
    }
}


// ************************************************************************* //
